<a id =99> </a>
# [Pandas](https://pandas.pydata.org/pandas-docs/version/1.3/user_guide/10min.html#)
* [Construct a DataFrame](#1)
* [Get Values from DataFrame](#2)
* [Append and Delete Data](#3)
* [Modify the Values in DataFrame](#4)
* [Sort DataFrame](#5)
* [Ravel DataFrame to Series](#6)
* [CSV/Excel to DataFrame](#7)

<a id =1> </a> 
*** 
## 1. Construct a DataFrame

In [215]:
import pandas as pd
df = pd.DataFrame({'Name':['Allen', 'Shaun', 'Chin'], 'Heigh':[170,171,175]})
df

    Name  Heigh
0  Allen    170
1  Shaun    171
2   Chin    175

In [216]:
# contruct using JSON list
# pd.DataFrame(Json list)
JSONls = [{'Name':'Tom', 'Heigh':150}, {'Name':'Alex', 'Heigh':200}]
df2 = pd.DataFrame(JSONls)
df2

   Name  Heigh
0   Tom    150
1  Alex    200

 <a id =2> </a>
 ***
 ## 2. Get Values from DataFrame
 ### Get a single value

In [217]:
# df['column name'][row ind]
df['Name'][1]

'Shaun'

In [218]:
# df.at[row ind, column name]
df.at[1, 'Name']

'Shaun'

In [219]:
# df.iloc[[row ind, column ind]]
df.iloc[1, 0]

'Shaun'

***
### Get a series from DataFrame

In [220]:
# get values in columns
Series = df['Name']
Series

0    Allen
1    Shaun
2     Chin
Name: Name, dtype: object

***
### Get a range of data from DataFrame

In [221]:
# df[column list][rows ind]
df2 = df[['Name', 'Heigh']][0:3]
df2

    Name  Heigh
0  Allen    170
1  Shaun    171
2   Chin    175

In [222]:
# df.iloc[row ind range, column ind range]
# [a:b] => a is included but b is excluded
df.iloc[0:3,0:2]

    Name  Heigh
0  Allen    170
1  Shaun    171
2   Chin    175

***
### Get data according to condition

In [223]:
# df[conditions]
df[df['Heigh']>170]

    Name  Heigh
1  Shaun    171
2   Chin    175

<a id =3> </a>
***
## 3. Append and Delete Data

### Append columns

In [224]:
# Add one series/column
df['Weight']=[70,60,80]
df

    Name  Heigh  Weight
0  Allen    170      70
1  Shaun    171      60
2   Chin    175      80

*** 
### Append rows

In [225]:
# Append a row: pd.concat([df, add_df])
add_df = pd.DataFrame([{'Name':'Charlie','Heigh':180,'Weight':90}])
df = pd.concat([df,add_df])
# Reset the index 
df = df.reset_index(drop=True) 
df

      Name  Heigh  Weight
0    Allen    170      70
1    Shaun    171      60
2     Chin    175      80
3  Charlie    180      90

***
### Delete columns

In [226]:
# Delete series/columns
del df['Weight']
df
# Another way: use drop() and give input axis=1(column)
# df = df.drop('Weight', axis = 1)

      Name  Heigh
0    Allen    170
1    Shaun    171
2     Chin    175
3  Charlie    180

***
### Delete rows

In [227]:
# Delete rows: drop(index list)
df = df.drop([2,3])
# Reset the index 
df = df.reset_index(drop=True)
df

    Name  Heigh
0  Allen    170
1  Shaun    171

<a id =4> </a>
***
## 4. Modify the Values in DataFrame

***
### Modify a single values

In [238]:
# Modify a single value of DataFrame: df.at[row_ind, column_name]
df.at[1,'Heigh'] = 180
df

    Name  Heigh
0  Allen    170
1  Shaun    180

*** 
### Replace contents according to condition

In [266]:
import numpy as np
# df = df['Heigh'].mask(condition, replace_value, inplace=True)
df['> 175'] = False
df['> 175'].mask(df['Heigh']>175 , True, inplace=True)
df

    Name  Heigh  > 175
0  Allen    170  False
1  Shaun    180   True

***
### Modify column name

In [267]:
# Modify the name of column: pd.rename(columns = {'old':'new'})
df = df.rename(columns = {'Heigh':'Heigh (cm)'})
df

    Name  Heigh (cm)  > 175
0  Allen         170  False
1  Shaun         180   True

<a id =5> </a>
***
## 5. Sort DataFrame

In [269]:
# Sort by column with ascending/decresing order 
df = df.sort_values(by='Heigh (cm)', ascending=False)
df

    Name  Heigh (cm)  > 175
1  Shaun         180   True
0  Allen         170  False

<a id =6> </a>
***
## 6. Ravel DataFrame to Series

In [293]:
# Ravel by 'C' order
df = pd.DataFrame({'Id':[1,2,3,4], 'Heigh':[170,171,175,180],'Weight':[30,50,35,60]})
ns1 = pd.Series(df.values.ravel('C')) # 'C' 
ns2 = pd.Series(df.values.ravel('K')) # 'C' 
df

   Id  Heigh  Weight
0   1    170      30
1   2    171      50
2   3    175      35
3   4    180      60

In [295]:
# Ravel by 'C' order
ns1

0       1
1     170
2      30
3       2
4     171
5      50
6       3
7     175
8      35
9       4
10    180
11     60
dtype: int64

In [296]:
# Ravel by 'K' order
ns2

0       1
1       2
2       3
3       4
4     170
5     171
6     175
7     180
8      30
9      50
10     35
11     60
dtype: int64

<a id =7> </a>
***
## 7. CSV/Excel to DataFrame

In [299]:
filenm = './examples/Cluster.csv'
data = pd.read_csv(filenm)
# data = pd.read_excel(filenm)
list_of_column_names = list(data.columns)
list_of_column_names

['Entry', 'Count', 'Cluster']

In [303]:
# Define the order of columns 
df = pd.DataFrame(data, columns=[list_of_column_names[0],list_of_column_names[2],list_of_column_names[1]])
df

  Entry  Cluster  Count
0     A       13   3140
1     B       13     12
2     C       13     10
3     D       13      7
4     E       13      7
5     F       13      6
6     G       13      6

[Back to Top](#99)